Revit 2024 API
StructuralSectionCParallelFlange Class
 Defines parameters for C-channel Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionCParallelFlange : StructuralSectionGeneralU
Visual Basic
Public Class StructuralSectionCParallelFlange _
	Inherits StructuralSectionGeneralU
Visual C++
public ref class StructuralSectionCParallelFlange : public StructuralSectionGeneralU
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
See Also
StructuralSectionCParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace